In [1]:
import pandas as pd

In [4]:
data = pd.read_csv('Location.csv')
data.squeeze()
location_data = data.copy()
location_data.head()

      Location
0   Location 3
1   Location 6
2   Location 8
3  Location 26
4  Location 34

In [5]:
location_data.index

RangeIndex(start=0, stop=1043, step=1)

In [8]:
location_data.index.name

In [10]:
location_data.index.name = 'Index'

In [11]:
location_data

          Location
Index
0       Location 3
1       Location 6
2       Location 8
3      Location 26
4      Location 34
...            ...
1038   Location 73
1039   Location 82
1040   Location 11
1041   Location 26
1042   Location 94

[1043 rows x 1 columns]

In [23]:
location_data.sort_values(by='Index')

          Location
Index
0       Location 3
1       Location 6
2       Location 8
3      Location 26
4      Location 34
...            ...
1038   Location 73
1039   Location 82
1040   Location 11
1041   Location 26
1042   Location 94

[1043 rows x 1 columns]

In [36]:
location_data.sort_values(by='Index').head()

SyntaxError: invalid syntax (3187635051.py, line 1)

In [37]:
location_data.sort_values(by='Location').tail()

          Location
Index
482    Location 97
128    Location 97
669    Location 97
757    Location 98
372    Location 99

In [26]:
location_data.index

RangeIndex(start=0, stop=1043, step=1, name='Index')

In [27]:
type(location_data.index)

pandas.core.indexes.range.RangeIndex

In [28]:
location_data.index.to_numpy()

array([   0,    1,    2, ..., 1040, 1041, 1042], dtype=int64)

In [46]:
location_data_sv = location_data.sort_values(by = 'Location', ascending = False)

In [39]:
location_data_sv.head()

          Location
Index
372    Location 99
757    Location 98
128    Location 97
482    Location 97
271    Location 97

In [40]:
location_data_sv.index

Int64Index([ 372,  757,  128,  482,  271,  669,  612,   29,  518,  598,
            ...
             904,  912, 1010,   14,  716,  202,  298,  637,  884,  465],
           dtype='int64', name='Index', length=1043)

In [42]:
location_data_sv.index = location_data_sv.index.sort_values()

In [43]:
location_data_sv.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            1033, 1034, 1035, 1036, 1037, 1038, 1039, 1040, 1041, 1042],
           dtype='int64', name='Index', length=1043)

In [44]:
location_data_sv.sort_index()

          Location
Index
0      Location 99
1      Location 98
2      Location 97
3      Location 97
4      Location 97
...            ...
1038   Location 10
1039   Location 10
1040    Location 1
1041    Location 1
1042    Location 1

[1043 rows x 1 columns]

In [47]:
location_data_sv

          Location
Index
372    Location 99
757    Location 98
128    Location 97
482    Location 97
271    Location 97
...            ...
202    Location 10
298    Location 10
637     Location 1
884     Location 1
465     Location 1

[1043 rows x 1 columns]